[
    {
        "id": "msi-gaming-geforce-gt-1030-4gb-gdrr4-64-bit-hdcp-support-directx-12",
        "name": "MSI Gaming GeForce GT 1030 4GB GDRR4 64-bit HDCP Support DirectX 12",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Chipset: NVIDIA GeForce GT 1030</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Video Memory: 4GB GDDR4</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Boost Clock: 1430 MHz</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Memory Interface: 64-bit</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Output: DisplayPort x 1 (v1.4a) / HDMI 2.0b x 1</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Electronics Accessories > Computer Components > I/O Cards & Adapters > Video Cards & Adapters",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/71AzaNckGgL._AC_SL1500.jpg?v=1722403037"
    },
    {
        "id": "ceiling-fans-with-lights-remote-app-control-38-low-profile-ceiling-fans-with-dimmable-white-colors-rgb-ring-lights",
        "name": "Ceiling Fans with Lights Remote/APP Control, 38\" Low Profile Ceiling Fans with Dimmable White Colors+ RGB Ring Lights",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">🌟 Independent RGB Side Light: This simple styling 5-blade fan light fan blade unfolding diameter has 38 inches, the light is divided into three-color white light and the side of the RGB aperture, you can use the remote control or cell phone APP to independently control the 2 kinds of light. Widely adapted to the needs of various occasions, such as bedroom, dining room, living room, bar, game room, etc., very unique.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">🌟 Reversible DC Motors: By pressing the F/R key on the remote control, you can switch the wind direction of the ceiling fan from the downdraft in summer to the updraft in winter, thus recovering the heat lost by the ceiling and distributing the heat evenly throughout the room. Compared with traditional AC motors, it is more energy efficient, more silent, and the noise level is less than 30 dB. It is more suitable for families with babies or elders.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">🌟 Remote &amp; APP Control: Remote control features include 6 speed speed, 3 color temperature and endless dimming, night light mode, 2/4-hour timing off (only fan), separate off lights or fans and so on. You can also scan the QR code on the manual, download the APP and pair it to control the fan light from your phone. Easily adapt to any scene needs, the perfect replacement for traditional fans or chandeliers. (Remote control can be installed on the wall as a wall switch)</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">🌟 High Quality: This ceiling fan is made of high-quality ABS material and metal, which is strong and durable. The fan motor adopts pure copper motor, which has the characteristics of strong power and low noise.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">🌟 Easy Installation: The installation of this ceiling fan is very simple, and we have detailed installation instruction and installation video, providing users with a cost-effective installation method, with safety hook included in the box, it can be easily installed by just one person. If you have any problems, please contact us. We provide 24-hour technical support.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Home & Garden > Household Appliances > Climate Control Appliances > Fans > Ceiling Fans",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/61lxnXGEPGL._AC_SL1500.jpg?v=1722402891"
    },
    {
        "id": "24-bladeless-ceiling-fan-with-rgb-light-remote-smart-led-ceiling-fans-with-voice-app-control",
        "name": "24\" Bladeless Ceiling Fan with RGB Light Remote, Smart LED Ceiling Fans with Voice/App Control",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Dimmable &amp; Light Multicolor】This smart LED ceiling fan light offers millions of colors of light, making it a personalized piece and subtle accent for your bedroom. The smart LED ceiling fan light supports adjustment from warm light (2700K) to daylight (6500K) and 10%-100% brightness adjustment. Ambient light adjustment: night light, RGB mood lighting, RGB cycle mode.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Smart APP and Voice Control】Add this smart fan light to your Tuya Smart App and connect to your Amazon Alexa/Google Assistant account in a 2.4Ghz network environment. Use simple voice commands. Control your fans light hands-free.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Energy-Saving &amp; Eye Protection】With two 24W LED lights, this modern ceiling fan is equivalent to the traditional 400W ten bulbs (40W one), providing 90% energy savings. The upgraded version of dimmable LED lights is more energy-efficient, gentle, and non-glaring to protect your eyes.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Safe Hidden Blade Enclosed Ceiling Fan】This low profile ceiling fan is bladeless, making it safer for children in kid's rooms, loft beds, and low ceilings. Children can climb around without the risk of getting hit by a fan blade.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【6 Wind Speeds &amp; Quiet DC Motor】This bladeless ceiling fan with lights remote control has 6 wind speeds to adjust, providing comfortable, natural &amp; cool wind. The High-Quality Copper Motor runs smoothly, with a strong airflow and no noise.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Reversible】The semi-flush mount ceiling fan has a DC motor and 5 invisible blades. It provides cool air in summer and reverses direction in winter to keep the indoor air circulating and fresh, keeping you warm.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">【Easy Install &amp; Clean】The components of the flush mount ceiling fan light have been assembled for easy installation. Included in the package are the installation manual, remote control, and accessories. The wind deflector is removable for easy cleaning without removing the entire ceiling fan.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Home & Garden > Household Appliances > Climate Control Appliances > Fans > Ceiling Fans",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/81uS9h89AVL._AC_SL1500.jpg?v=1722402668"
    },
    {
        "id": "sceptre-27-inch-curved-gaming-monitor-up-to-240hz",
        "name": "Sceptre 27-inch Curved Gaming Monitor up to 240Hz",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">240Hz Refresh Rate: Stay above the pack with 240Hz, giving you an edge in performance as frames transition instantly.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">1ms Response Time: Colors fade and illuminate instantly with a 1ms response time, eliminating ghosting and piecing together precise imagery during action-packed scenes and gaming.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">1500R Curvature: The 1500R degree curved design immerses you completely into the gaming landscape, allowing you to spot all threats and opportunities before all of your competitors.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Edgeless Design: Edgeless Design completely immerses you in all the captivating action and extraordinary scenery that FHD resolution &amp; 165Hz refresh rate have to offer.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Blue Light Shift: Blue Light Shift reduces blue light, allowing you to comfortably work, watch, or play applications without straining your eyes.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Video > Computer Monitors",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/71Yhj9RtIiL._AC_SL1500.jpg?v=1722402419"
    },
    {
        "id": "redragon-gs560-rgb-desktop-soundbar-2-0-channel-computer-speaker",
        "name": "Redragon GS560 RGB Desktop Soundbar, 2.0 Channel Computer Speaker",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Rich Sounds &amp; Look - The first Redragon RGB sound bar has the upgraded driver that delivers clear and crystal sound quality combined with rich bass. 4 different backlit modes includes both dynamic and static glowing LED illumination.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Lightshow Projection - What's better than play your favorite music while gaming or working? An illuminating backlight show sync to the playing music. Classic with RGB, you can sit and watch this all day.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Bounce to Daylight - Easy to place it underneath any device you have, about 16 inches compact size suits perfect for your audio system. Whether you’re feeling Wave, Disco, Rain, or something in-between, start bouncing with your music today.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Handy Volume Knob - Delicate and compact volume knob combined with on/off switch offers you a convenient and precise volume adjustment.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Plug &amp; Play for Broad Compatibility - USB powered with 3.5mm audio and mic cables allows this rockstar to party on wide type of stages for PC, TV, Laptop and Smartphone. Get it all connected well on your device and spice up your next party.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Audio > Audio Components > Speakers",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/61WltEBabEL._AC_SL1500.jpg?v=1722402114"
    },
    {
        "id": "redragon-gs520-rgb-desktop-speakers-2-0-channel-pc-computer-stereo-speaker",
        "name": "Redragon GS520 RGB Desktop Speakers, 2.0 Channel PC Computer Stereo Speaker",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Enhanced Clear Sound - Equipped with advanced sound drive unit with full range 2.0 channel enhanced stereo core, GS520 ANVIL offers you superior auditory feast.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Touch Controlled RGB Lighting - Not only the sound quality is solid, but also the lighting bar is attractive. 6 modes are choosable for different vibes by touch-control, switch off the light is also available.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">More Than Fancy - Minimalism modern urban design with brushed material style, the seamless blend of dynamic stylish and upscale textural feel.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Easy-access Volume Control - Individual volume up and volume down buttons make adjusting the volume easy and accurate.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Plug &amp; Play for Broad Compatibility - USB powered with 3.5mm audio and mic cables allows this rockstar to party on wide types of stages for PC, TV, and Laptop. Up to 31 in (80 cm) cable length between two speakers.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Audio > Audio Components > Speakers",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/71UuyaUmkhL._AC_SL1500.jpg?v=1722401666"
    },
    {
        "id": "govee-ai-sync-box-with-monitor-backlight-hdmi-2-0-4k",
        "name": "Govee AI Sync Box With Monitor Backlight, HDMI 2.0 4K",
        "description": "<p>Enhance your gaming experience with the Govee AI Sync Box. This innovative device seamlessly synchronizes your monitor backlight with the content on your screen, creating a fully immersive and dynamic gaming environment. Featuring HDMI 2.0 compatibility and support for 4K resolution, the Govee AI Sync Box is the ideal accessory for modern gamers seeking to elevate their setup.</p>\n<p>With video inputs including HDMI 2.0 and a most suitable for gaming aspect, this product is a must-have for any serious gamer. Take your gaming experience to the next level with the Govee AI Sync Box.</p>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Video > Video Accessories",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/71N6gEZsQyL._AC_SL1500.jpg?v=1722400131"
    },
    {
        "id": "rgb-hexagon-lights-with-music-mode",
        "name": "RGB Hexagon Lights with Music Mode",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">GORGEOUS RGB LIGHTS: The RGB hexagon led lights garage Lights adopt RGB gradient technology,honeycomb Light Ceiling each light tube has a different light color, and the light is more gorgeous. Smooth gradation colors and monochrome, gorgeous lights adorn your walls.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Home & Garden > Lighting",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/71XyOhNMbWL._AC_SL1500.jpg?v=1722399773"
    },
    {
        "id": "pny-geforce-rtx™-4090-24gb-verto™-triple-fan-graphics-card-dlss-3",
        "name": "PNY GeForce RTX™ 4090 24GB VERTO™ Triple Fan Graphics Card DLSS 3",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Powered by NVIDIA DLSS 3, ultra-efficient Ada Lovelace arch, and full ray tracing</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">NVIDIA Ada Lovelace, with 2235MHz core clock and 2520MHz boost clock speeds to help meet the needs of demanding games.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">24GB GDDR6X (384-bit) on-board memory, plus 16384 CUDA processing cores and up to 1008GB/sec of memory bandwidth provide the memory needed to create striking visual realism.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">PCI Express 4.0 interface - Offers compatibility with a range of systems. Also includes DisplayPort and HDMI outputs for expanded connectivity.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">NVIDIA GeForce Experience - Capture and share videos, screenshots, and livestreams with friends. Keep your drivers up to date and optimize your game settings. It's the essential companion to your GeForce graphics card.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Electronics Accessories > Computer Components > I/O Cards & Adapters > Video Cards & Adapters",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/619QTa9dXXL._AC_SL1000.jpg?v=1722399387"
    },
    {
        "id": "romoss-10000mah-power-bank-slim-portable-charger-2-pack",
        "name": "ROMOSS 10000mAh Power Bank, Slim Portable Charger (2-Pack)",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">2-Pack – Ultra Portable Power Bank, one of the slimmest and lightest 10000mAh Travel Chargers, at just 7.19 ounces and 0.6 inches thick. Delivering 2.1 charges to the iPhone 14, 2 charges to the Galaxy S23, and 1.3 charges to the iPad Mini 5</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Fast and Efficient Charging; via it’s Micro USB Input: 5V/2.1A and USB A Output: 5V/2.4A. The portable phone charger will only take 6-8 hours to be fully charged. Ideal for those who need quick and reliable charging on the go</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Universal Compatibility with iPhones, Android phones, tablets and many more USB powered devices. The LED Indicator keeps track of the remaining power status</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Robust Safety Features; The built-in intelligent multi safety system provides complete protection against over-heat, over-charge, over-current, over-discharge, and short-circuits</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Portable and Durable Design: Designed for on-the-go use, this small power bank is slim, compact and lightweight. Take it with you on your travels, outdoor adventures, or simply keep it in your bag or backpack as backup charger</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Electronics Accessories > Power > Power Adapters & Chargers > Power Banks",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/51jqw_CnRwL._AC_SL1500.jpg?v=1722399046"
    },
    {
        "id": "romoss-for-magsafe-battery-pack-10000mah-magnetic-power-bank-20w",
        "name": "ROMOSS for Magsafe Battery Pack, 10000MAh Magnetic Power Bank 20W",
        "description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">3-in-1 Cable: Elevate versatility with the integrated 20W dual-head USB-C and Lightning cable, ensuring bidirectional fast charging for maximum convenience.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Magnetic Powerbank: Embraces Magsafe wireless charging for a secure and efficient magnetic link. With 14N powerful magnets, the wireless charger can firmly hold your phone, perfect for easy handheld and one-handed use.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Powerful 10000mAh Capacity: Long-lasting energy to keep your devices charged throughout the day, making it an ideal companion for travel, work, and daily activities.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Designed for Mobility: Slip it into your pocket or bag effortlessly and enjoy reliable power wherever you wander</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Lasts Longer, Powers More: Get peace of mind with a long-lasting battery that retains 95% of its maximum capacity even after 12 months.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">Universal Compatibility: Simultaneously charge various devices, whether you have an iPhone or USB C device, our charger is your one-stop power solution.</span></li>\n<li class=\"a-spacing-mini\"><span class=\"a-list-item\">What You Get: Magsafe Battery Pack*1, 20W Fast Charging USB-C &amp; Lightning Cable*1, User Manual *1. ROMOSS 12-Month Warranty.</span></li>\n</ul>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Electronics Accessories > Power > Power Adapters & Chargers > Power Banks",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/61yn4x1sWOL._AC_SL1500.jpg?v=1722397384"
    },
    {
        "id": "2-pcs-phone-games-sweat-proof-finger-gloves-thumbs",
        "name": "2 Pcs Phone Games Sweat-Proof Finger Gloves Thumbs",
        "description": "<p>✔ silver fiber material, thin and sensitive. Both thumb and index fingers can wear, more convenient to use.<br>✔ air permeability and sweat-proof, the contact surface between fingers and air is increased by 50%, the evaporation area is increased, more refreshing and breathable.<br>✔ High-precision sewing to eliminate finger seams, and upgrade touch feeling. Help you works perfecting on aiming and firing, and don't worry about grinding hands fingers sultry.<br>✔ The finger covers bring long-lasting and dry operation, and control freely, let you enjoy the games.<br>✔ Small and lightweight, you can bring and use it wherever you go. Perfectly compatible for games including for for etc.</p>\n<!---->",
        "brand": "LT.Gaming Supplies",
        "category": "Electronics > Electronics Accessories > Computer Components > Input Device Accessories > Game Controller Accessories",
        "price": "19.99",
        "image": "https://cdn.shopify.com/s/files/1/0697/9973/9620/files/61TGzyjMuAL._AC_SL1024.jpg?v=1722315094"
    }
]